"""
题目：
给一个不多于5位的正整数，
要求：一、求它是几位数，二、逆序打印出各位数字。
"""

#自己的解法
a = int(input("请输入一个不多于5位的正整数："))

if a < 100000:
        #求它为几位数
        if a // 10000 != 0:
            print("其为5位数")
            
        elif a % 10000 // 1000 != 0:
            print("其为4位数")

        elif a % 10000 // 100 != 0:
            print("其为3位数")
            
        elif a % 10000 // 10 != 0:
            print("其为2位数")

        elif a % 10 != 0:
            print("其为1位数") 
else:
    print("请输入正确的数字") 

#逆序打印
print(f"逆序输出为{str(a)[::-1]}")    




#标准答案
#程序分析：学会分解出每一位数
 
x = int(input("请输入一个数:\n"))
a = x // 10000
b = x % 10000 // 1000
c = x % 1000 // 100
d = x % 100 // 10
e = x % 10
 
if a != 0:
    print ("5 位数：",e,d,c,b,a)
elif b != 0:
    print ("4 位数：",e,d,c,b)
elif c != 0:
    print ("3 位数：",e,d,c)
elif d != 0:
    print ("2 位数：",e,d)
else:
    print ("1 位数：",e)    