"""
题目：
企业发放的奖金根据利润提成。
利润(I)低于或等于10万元时，奖金可提10%；
利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%；
20万到40万之间时，高于20万元的部分，可提成5%；
40万到60万之间时高于40万元的部分，可提成3%；
60万到100万之间时，高于60万元的部分，可提成1.5%，
高于100万元时，超过100万元的部分按1%提成，从键盘输入当月利润I，求应发放奖金总数？
"""

#方法1：直接使用判断进行判别

"""
I = int(input("请输入您今年的业绩："))
reward_1 = I * 0.1
if I <= 100000:
    total = reward_1
elif 100000 < I <= 200000:
    reward_2 = (I - 100000) * 0.075
    total = reward_1 + reward_2
elif 200000 < I <= 400000:
    reward_2 = (I - 200000) * 0.075
    reward_3 = (I - 400000) * 0.05
    total = reward_1 + reward_2 +reward_3
elif 400000 < I <= 600000:
    reward_2 = (I - 200000) * 0.075
    reward_3 = (I - 400000) * 0.05
    reward_4 = (I - 400000) * 0.03
    total = reward_1 + reward_2 + reward_3 + reward_4 
elif 600000 < I <= 1000000:
    reward_2 = (I - 100000) * 0.075
    reward_3 = (I - 200000) * 0.05
    reward_4 = (I - 400000) * 0.03
    reward_5 = (I - 600000) * 0.015
    total = reward_1 + reward_2 + reward_3 + reward_4 + reward_5
else:
    reward_2 = (I - 100000) * 0.075
    reward_3 = (I - 200000) * 0.05
    reward_4 = (I - 400000) * 0.03
    reward_5 = (I - 600000) * 0.015
    reward_6 = (I - 1000000) * 0.01
    total = reward_1 + reward_2 + reward_3 + reward_4 + reward_5 + reward_6
print(f"恭喜您获得奖金为：{total}")
计算错误原因：
每个条件分支都在计算前面区间时，
比例会出现问题
"""

I = int(input("请输入您今年的业绩："))

if I <= 100000:
    total = I * 0.1
elif I <= 200000:
    total = 100000 * 0.1 + (I - 100000) * 0.075
elif I <= 400000:
    total = 100000 * 0.1 + 100000 * 0.075 + (I - 200000) * 0.05
elif I <= 600000:
    total = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + (I - 400000) * 0.03
elif I <= 1000000:
    total = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + 200000 * 0.03 + (I - 600000) * 0.015
else:
    total = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + 200000 * 0.03 + 400000 * 0.015 + (I - 1000000) * 0.01

print(f"恭喜您获得奖金为：{total}")



#方法2（答案）通过定义数据容器来实现简单判别
#分析：利用数轴来分界，定位。
i = int(input("请您输入今年您获得的总工资："))
salary = [1000000 , 600000, 400000, 200000, 100000, 0]
persent = [0.01, 0.015, 0.03, 0.05, 0.075, 0.1]
r = 0
for idx in range(0,6):
    if i > salary[idx]:
        r += (i-salary[idx]) * persent[idx]
        print((i-salary[idx]) * persent[idx])
        i = salary[idx]
print(r)




