"""
题目：
输入一个奇数，然后判断最少几个 9 除于该数的结果为整数。
"""

#自己的解法：要求用户输入数字，再进行判断是否为奇数，最后再进行判断最少几个9除以该数为整数（个人理解为取整计算）
#错误：理解题意错误，正确题意：一个可以被用户输入的奇数整除的数字9组成的数

#输入奇数
a = int(input("请输入一个奇数："))

#对于输入数字先进行判断是否为奇数
if a % 2 == 0 and a % 4 == 0:
    print("抱歉您输入的数字错误")
else:
    b = a // 9
    print(f"最少需要{b}个9除以该数字结果为整数")



#标准答案
#程序分析：999999 / 13 = 76923
 
if __name__ == '__main__':
    zi = int(input('输入一个数字:\n'))
    n1 = 1
    c9 = 1
    m9 = 9
    sum = 9
    while n1 != 0:
        if sum % zi == 0:
            n1 = 0
        else:
            m9 *= 10
            sum += m9
            c9 += 1
    print('%d 个 9 可以被 %d 整除 : %d' % (c9,zi,sum))
    r = sum / zi
    print('%d / %d = %d' % (sum,zi,r))